; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-3 - location
	p2-4 - location
	p3-0 - location
	p4-0 - location
	p4-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s1)
	(at driver5 s1)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s4)
	(at package2 s3)
	(at package3 s1)
	(at package4 s1)
	(at package5 s3)
	(at package6 s4)
	(at package7 s1)
	(at package8 s4)
	(at package9 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 42)
	(= (time-to-drive s1 s0) 42)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 88)
	(= (time-to-drive s2 s0) 88)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 57)
	(= (time-to-drive s4 s0) 57)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 46)
	(= (time-to-drive s2 s1) 46)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 60)
	(= (time-to-drive s4 s1) 60)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 4)
	(= (time-to-drive s0 s3) 4)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 49)
	(= (time-to-drive s2 s3) 49)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 53)
	(= (time-to-drive s4 s3) 53)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s0)
	(at driver4 s2)
	(at truck1 s0)
	(at truck2 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s3)
	(at package1 s3)
	(at package2 s3)
	(at package3 s4)
	(at package6 s0)
	(at package7 s4)
	(at package8 s3)
	(at package9 s2)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 16
2. (load-truck package6 truck3 s4)
   deleted: (at package6 s4)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 16
3. (drive-truck truck3 s4 s3 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 0 to 583
   goals met: 1 of 16
4. (board-truck driver4 truck5 s1)
   deleted: (at driver4 s1) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 16
5. (load-truck package7 truck5 s1)
   deleted: (at package7 s1)
   added: (in package7 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 1 of 16
6. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 1 of 16
7. (load-truck package3 truck5 s1)
   deleted: (at package3 s1)
   added: (in package3 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 1 of 16
8. (walk driver2 s0 p4-0)
   deleted: (at driver2 s0)
   added: (at driver2 p4-0)
   goals met: 1 of 16
9. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 1 of 16
10. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 2 of 16
11. (unload-truck package6 truck3 s3)
   deleted: (in package6 truck3)
   added: (at package6 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 2 of 16
12. (walk driver2 p4-0 s4)
   deleted: (at driver2 p4-0)
   added: (at driver2 s4)
   goals met: 3 of 16
13. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 16
14. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 16
15. (drive-truck truck5 s1 s0 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (fuel-used) from 583 to 1129
   goals met: 3 of 16
16. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 3 of 16
17. (drive-truck truck5 s0 s4 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 1129 to 1870
   goals met: 3 of 16
18. (unload-truck package3 truck5 s4)
   deleted: (in package3 truck5)
   added: (at package3 s4)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 4 of 16
19. (load-truck package1 truck5 s4)
   deleted: (at package1 s4)
   added: (in package1 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 4 of 16
20. (load-truck package8 truck5 s4)
   deleted: (at package8 s4)
   added: (in package8 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 4 of 16
21. (load-truck package9 truck5 s4)
   deleted: (at package9 s4)
   added: (in package9 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 4 of 16
22. (drive-truck truck5 s4 s1 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (fuel-used) from 1870 to 3070
   goals met: 4 of 16
23. (drive-truck truck5 s1 s2 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 3070 to 3990
   goals met: 4 of 16
24. (unload-truck package9 truck5 s2)
   deleted: (in package9 truck5)
   added: (at package9 s2)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 5 of 16
25. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 16
26. (unload-truck package6 truck1 s3)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 16
27. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 3990 to 4480
   goals met: 5 of 16
28. (drive-truck truck5 s2 s0 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 4480 to 5888
   goals met: 5 of 16
29. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 5888 to 6378
   goals met: 5 of 16
30. (drive-truck truck5 s0 s4 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 6378 to 7290
   goals met: 5 of 16
31. (unload-truck package7 truck5 s4)
   deleted: (in package7 truck5)
   added: (at package7 s4)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 6 of 16
32. (drive-truck truck5 s4 s3 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (fuel-used) from 7290 to 7979
   goals met: 7 of 16
33. (unload-truck package1 truck5 s3)
   deleted: (in package1 truck5)
   added: (at package1 s3)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 8 of 16
34. (load-truck package6 truck2 s3)
   deleted: (at package6 s3)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 8 of 16
35. (disembark-truck driver4 truck5 s3)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 8 of 16
36. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 7979 to 8023
   goals met: 8 of 16
37. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 16
38. (unload-truck package8 truck5 s3)
   deleted: (in package8 truck5)
   added: (at package8 s3)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 10 of 16
39. (board-truck driver4 truck4 s3)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 10 of 16
40. (drive-truck truck4 s3 s2 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (fuel-used) from 8023 to 8513
   goals met: 10 of 16
41. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 11 of 16
42. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   goals met: 10 of 16
43. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 9 of 16
44. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   goals met: 9 of 16
45. (disembark-truck driver4 truck4 s2)
   deleted: (driving driver4 truck4)
   added: (at driver4 s2) (empty truck4)
   goals met: 10 of 16
46. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 10 of 16
47. (drive-truck truck3 s3 s0 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 8513 to 8553
   goals met: 10 of 16
48. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 11 of 16
49. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   goals met: 10 of 16
50. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   goals met: 10 of 16
51. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 16
52. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 8553 to 8973
   goals met: 11 of 16
53. (walk driver2 s4 p4-0)
   deleted: (at driver2 s4)
   added: (at driver2 p4-0)
   goals met: 10 of 16
54. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 8973 to 9013
   goals met: 11 of 16
55. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 9013 to 9433
   goals met: 10 of 16
56. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 9 of 16
57. (walk driver2 p4-0 s0)
   deleted: (at driver2 p4-0)
   added: (at driver2 s0)
   goals met: 9 of 16
58. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 16
59. (drive-truck truck3 s0 s2 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 9433 to 10313
   goals met: 10 of 16
60. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 10313 to 11193
   goals met: 10 of 16
61. (disembark-truck driver4 truck4 s2)
   deleted: (driving driver4 truck4)
   added: (at driver4 s2) (empty truck4)
   goals met: 11 of 16
62. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 11 of 16
63. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 12 of 16
64. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 16
65. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 11 of 16
66. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 11193 to 11653
   goals met: 12 of 16
67. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 16
68. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 12 of 16
69. (drive-truck truck4 s2 s1 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (fuel-used) from 11653 to 12113
   goals met: 13 of 16
70. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 13 of 16
71. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 14 of 16
72. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 14 of 16
73. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 14 of 16
74. (drive-truck truck4 s1 s4 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   changed: (fuel-used) from 12113 to 12713
   goals met: 13 of 16
75. (disembark-truck driver4 truck4 s4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s4) (empty truck4)
   goals met: 13 of 16
76. (walk driver4 s4 p2-4)
   deleted: (at driver4 s4)
   added: (at driver4 p2-4)
   goals met: 13 of 16
77. (walk driver4 p2-4 s2)
   deleted: (at driver4 p2-4)
   added: (at driver4 s2)
   goals met: 14 of 16
78. (board-truck driver5 truck2 s1)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 14 of 16
79. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 13 of 16
80. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 13 of 16
81. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 13 of 16
82. (drive-truck truck4 s4 s0 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 12713 to 13283
   goals met: 13 of 16
83. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 14 of 16
84. (drive-truck truck2 s1 s4 driver5)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 13283 to 13883
   goals met: 13 of 16
85. (disembark-truck driver5 truck2 s4)
   deleted: (driving driver5 truck2)
   added: (at driver5 s4) (empty truck2)
   goals met: 13 of 16
86. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   goals met: 13 of 16
87. (board-truck driver5 truck2 s4)
   deleted: (at driver5 s4) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 13 of 16
88. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 12 of 16
89. (drive-truck truck2 s4 s1 driver5)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 13883 to 14483
   goals met: 13 of 16
90. (drive-truck truck4 s0 s1 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 14483 to 14903
   goals met: 14 of 16
91. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 14 of 16
92. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   goals met: 14 of 16
93. (walk driver2 s0 p4-0)
   deleted: (at driver2 s0)
   added: (at driver2 p4-0)
   goals met: 14 of 16
94. (walk driver2 p4-0 s4)
   deleted: (at driver2 p4-0)
   added: (at driver2 s4)
   goals met: 15 of 16
95. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 15 of 16
96. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 16 of 16
